app/controllers/students_controller.rb

  def create
    @student = Student.new(params.require(:student))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-09-24 20:03:37.038600"], ["updated_at", "2017-09-24 20:03:37.038600"]]

  def update
    @student =Student.find(params[:id])
    @student.update(params.require(:student))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-09-24 20:03:37.408731"], ["id", 1]]